tutorial/hardwood/oak(Lee2018)/30K/RACHC/0/weightedK_
300 1.11478e-05
300.15 1.12269e-05
300.3 1.13066e-05
300.45 1.13877e-05
300.5 1.14135e-05
300.65 1.14942e-05
300.8 1.15754e-05
300.95 1.16582e-05
301 1.16845e-05
301.15 1.17668e-05
301.3 1.18497e-05
301.45 1.19341e-05
301.5 1.19609e-05
301.65 1.20448e-05
301.8 1.21293e-05
301.95 1.22154e-05
302 1.22427e-05
302.15 1.23284e-05
302.3 1.24145e-05
302.45 1.25024e-05
302.5 1.25301e-05
302.65 1.26174e-05
302.8 1.27053e-05
302.95 1.27949e-05
303 1.28232e-05
303.15 1.29122e-05
303.3 1.30017e-05
303.45 1.30931e-05
303.5 1.31219e-05
303.65 1.32127e-05
303.8 1.3304e-05
303.95 1.33972e-05
304 1.34265e-05
304.15 1.3519e-05
304.3 1.3612e-05
304.45 1.37071e-05
304.5 1.37369e-05
304.65 1.38312e-05
304.8 1.3926e-05
304.95 1.40229e-05
305 1.40533e-05
305.15 1.41494e-05
305.3 1.4246e-05
305.45 1.43448e-05
305.5 1.43757e-05
305.65 1.44736e-05
305.8 1.45721e-05
305.95 1.46728e-05
306 1.47043e-05
306.15 1.48041e-05
306.3 1.49044e-05
306.45 1.50071e-05
306.5 1.50391e-05
306.65 1.51407e-05
306.8 1.52429e-05
306.95 1.53476e-05
307 1.53801e-05
307.15 1.54837e-05
307.3 1.55878e-05
307.45 1.56945e-05
307.5 1.57276e-05
307.65 1.58331e-05
307.8 1.59392e-05
307.95 1.60478e-05
308 1.60815e-05
308.15 1.61889e-05
308.3 1.6297e-05
308.45 1.64077e-05
308.5 1.6442e-05
308.65 1.65514e-05
308.8 1.66614e-05
308.95 1.67743e-05
309 1.68091e-05
309.15 1.69205e-05
309.3 1.70326e-05
309.45 1.71475e-05
309.5 1.71829e-05
309.65 1.72964e-05
309.8 1.74105e-05
309.95 1.75276e-05
310 1.75635e-05
310.15 1.76791e-05
310.3 1.77952e-05
310.45 1.79145e-05
310.5 1.7951e-05
310.65 1.80687e-05
310.8 1.81869e-05
310.95 1.83084e-05
311 1.83455e-05
311.15 1.84653e-05
311.3 1.85856e-05
311.45 1.87094e-05
311.5 1.87471e-05
311.65 1.8869e-05
311.8 1.89915e-05
311.95 1.91175e-05
312 1.91558e-05
312.15 1.92798e-05
312.3 1.94045e-05
312.45 1.95329e-05
...
1273 9.69908e-09
