tutorial/hardwood/oak(Lee2018)/30K/RACHC/constant/coalCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      coalCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    transient       yes;
    coupled         yes;
    cellValueSourceCorrection on;

    sourceTerms
    {
        schemes
        {
            rho             semiImplicit 1;
            U               semiImplicit 1;
            Yi              semiImplicit 1;
            h               semiImplicit 1;
// 	    h               explicit 1;
            radiation       semiImplicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
        G               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

constantProperties
{
    rho0            884;
    T0              300;
    Cp0             1500;
    epsilon0        0.8;
    f0              0.5;

    TDevol          300;
    LDevol          0;
    hRetentionCoeff 1;

    constantVolume  true;

//     parcelTypeId    1;
//
//     rhoMin          1e-15;
//     TMin            200;
//     pMin            1000;
//     minParticleMass 1e-15;
//
//     rho0            884;// add
//     T0              298;// add
//     Cp0             1500;// add
//
//     youngsModulus   2e9;
//     poissonsRatio   0.35;
//
//     epsilon0        0.8;//particle emissivity []
//     f0              0.5;
//
//     Pr              0.7;
//     TDevol          400;// add
//     LDevol          0;
//     hRetentionCoeff 3390.0;// add as COmiga--activation energy in omega function
//     Srinkalpha      0.5; // add
//     Srinkbeta       0.0; // add
//     Srinkgamma      0.5;// add
//     Porositygas     0.6;// add
//     shrinkageMode   1;
//     constantVolume  false; // add
//
//
//
//
//     //for layer model
// //     rhopWetWood    750;
// //     rhopDryWood    750;
// //     rhopCharWood    750;
// //     rhopCore    750;
// //     kpWetWood    0.09;
// //     kpDryWood    0.12;
// //     kpCharWood    0.06;
// //     kpCore    0.09;
// //     alphapWetWood    1e-07;
// //     alphapDryWood    2e-7;
// //     alphapCharWood    3e-07;
// //     alphapCore    1e-07;
//
//     //- Layer initial properties
//     Tb00    298;
//     Tb10    298;
//     Tb20    298;
//     Tb30    298;
//     rb00    0.0047455;
//     rb10    0.004747;
//     rb20    0.0047485;
//     rb30    0.00475;
//     Tp00    298;
//     Tp10    298;
//     Tp20    298;
//     Tp30    298;
//
//     deltaTime 5e-6;
//
//     hCoeff 58;
//

}

subModels
{
    particleForces
    {
        //sphereDrag;
        gravity;
    }

    injectionModels
    {
        model1
        {
            type            manualInjection;
            massTotal       0;
            parcelBasisType fixed;
            nParticle       1;
            SOI             0;
            positionsFile   "coalCloud1Positions";
            U0              (0 0 0);

//             sizeDistribution
//             {
//                 type        normal;
//
//                 normalDistribution
//                 {
//                      expectation    6.9e-04; //add
//                      variance       3.0e-05;
//                      minValue       6.0e-04;
//                      maxValue       7.8e-04;
//                 }
//             }
            sizeDistribution
            {
                type        fixedValue;
                fixedValueDistribution
                {
                    value   0.0003;
                }
            }
            flowRateProfile constant 1;
        }
    }

    dispersionModel none; // add

    patchInteractionModel localInteraction;

    stochasticCollisionModel none;

    heatTransferModel RanzMarshall;

    compositionModel singleMixtureFraction;

    phaseChangeModel liquidEvaporation;

    devolatilisationModel ancaSecCharDevolatilisation; //add

    surfaceReactionModel none; //add

    surfaceFilmModel none;

    radiation       on;

    localInteractionCoeffs
    {
       patches
       (
          WALL
          {
            type     rebound;
          }
          OUTLET
          {
	    type escape;
	  }
	            INLET
          {
	    type escape;
	  }
       );
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  false;
    }

    singleMixtureFractionCoeffs
    {
        phases
        (
            gas // number doesn't mean any thing
            {
                H2              0.00;
                H2O             0.00;
                CO             0.00;
                CO2             0.00;
                CH2O             0.00;
                HCOOH             0.00;
                CH4             0.00;
                CH3OH             0.00;
                C2H2O2             0.00;
                C2H4             0.0;
                CH3CHO             0.0;
                C2H4O2             0.0;
                C2H5OH             0.0;
                C2H3CHO             0.0;
                C2H5CHO             0.0;
                C5H8O4             0.0;
                C6H5OH             0.0;
                C6H6O3             0.0;
                C6H10O5             0.0;
                C6H5OCH3             0.0;
                C9H10O2             0.0;
                C11H12O4             0.0;
                U2ME12             0.0;
                MLINO             0.0;
                LINOACID             1.00;
            }
            liquid
            {
                H2O             1.0;
            }
            solid
            {
                CELL            0.4972;
                CELLA           0.0;
                HCE             0.2252;
                HCE1            0.0;
                HCE2            0.0;
                LIG-C            0.0;
                LIG-H            0.0414;
                LIG-O            0.1560;
                LIG-CC           0.0;
                LIG-OH           0.0;
                LIG             0.0;
                TGL             0.0301;
                CTANN           0.0251;
                ITANN           0.0;
                GCO2            0.0;
                GCO             0.0;
                GCOH2           0.0;
                GH2             0.0;
                GCH4            0.0;
                GCH3OH          0.0;
                GC2H4           0.0;
                GH2O            0.025;
                C               0.0;
                ash             0.0;
            }
        );
        YGasTot0        0.0;
        YLiquidTot0     0.0;
        YSolidTot0      1.0;
    }

    liquidEvaporationCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids
        (
            H2O
        );
    }
    ancaSecCharDevolatilisationCoeffs
    {
        volatileData
        (
            (H2)
            (H2O)
            (CO)
            (CO2)
            (CH2O)
            (HCOOH)
            (CH4)
            (CH3OH)
            (C2H2O2)
            (C2H4)
            (CH3CHO)
            (C2H4O2)
            (C2H5OH)
            (C2H3CHO)
            (C2H5CHO)
            (C5H8O4)
            (C6H5OH)
            (C6H6O3)
            (C6H10O5)
            (C6H5OCH3)
            (C9H10O2)
            (C11H12O4)
            (U2ME12)// U2ME12 //C13H22O2
            (MLINO)// MLINO //C19H34O2
            //(LINOACID)
        );

        solidMolarMass
        (
                (CELL            162.0)
                (CELLA           162.0)
                (HCE             132.0)
                (HCE1            132.0)
                (HCE2            132.0)
                (LIG-C            258.0)
                (LIG-H            436.0)
                (LIG-O            422.0)
                (LIG-CC           258.0)
                (LIG-OH           378.0)
                (LIG             208.0)
                (TGL           896.0)//C57H100O7
                (CTANN           304.0)//C15H12O7
                (ITANN           210.0)//C9H6O6
                (GCO2            44.0)
                (GCO             28.0)
                (GCOH2           30.0)
                (G2COH2          30.0)
                (G3COH2          30.0)
                (GH2             2.0)
                (GCH4              16.0)
                (GCH3OH             32.0)
                (GC2H4             28.0)
                (C               12.0)
                (GH2O            18.0)
                (ash             60.0)
        );

        gasMolarMass
        (
       	(H2	2)
               (H2O	18)
              	(CO	28)
              	(CO2	44)
              	(CH2O	30)
              	(HCOOH	46)
              	(CH4	16)
              	(CH3OH	32)
              	(C2H2O2	58)
              	(C2H4	28)
              	(CH3CHO	44)
              	(C2H4O2	60)
              	(C2H5OH	46)
              	(C2H3CHO	56)
              	(C2H5CHO	58)
              	(C5H8O4	132)
              	(C6H5OH	94)
              	(C6H6O3	126)
              	(C6H10O5	162)
              	(C6H5OCH3	108)
              	(C9H10O2	150)
              	(C11H12O4	208)
                (U2ME12 210)//(U2ME12  210)
                (MLINO 294)//(MLINO 294)
        );

        residualCoeff   0.001;
    }

//     DiBlasiDevolatilisationCoeffs
//     {
//
//       woodProximate     (0.45 0.06 0.49); // (C H O)
//       tarProximate      (0.53 0.065 0.401); // (C  H  O)
//
//       secondGasVersion 3;
//
//       //Thurner and Mann 1981
//       //devolKinetic1     (5.16E+06 8.400E+07 ); // (A1 E1 ) wood gas1
//       //devolKinetic2     (1.48E+10 1.127E+08 ); // (A2 E2 ) wood tar
//       //devolKinetic3             (2.66E+10 1.065E+08 ); // (A3 E3 ) wood char
//
//       //Thurner and Mann 1981 version 2
//       //devolKinetic1     (1.43E+04 8.860E+07 ); // (A1 E1 ) wood gas1
//       //devolKinetic2     (4.12E+06 1.127E+08 ); // (A2 E2 ) wood tar
//       //devolKinetic3     (7.40E+05 1.065E+08 ); // (A3 E3 ) wood char
//
//       //Chan 1985
//       //devolKinetic1     (1.30E+08 1.40E+08 ); // (A1 E1 ) wood gas1
//       //devolKinetic2     (2.00E+08 1.33E+08 ); // (A2 E2 ) wood tar
//       //devolKinetic3               (1.08E+07 1.21E+08 ); // (A3 E3 ) wood char
//
//       //Font 1990
//       //devolKinetic1     (1.52E+07 1.392E+08 ); // (A1 E1 ) wood gas1
//       //devolKinetic2     (5.85E+06 1.190E+08 ); // (A2 E2 ) wood tar
//       //devolKinetic3	  (2.98E+03 7.310E+07 ); // (A3 E3 ) wood char
//
//       // DI BLASI
//       //devolKinetic1     (4.4E+09 1.53E+08 ); // (A1 E1 ) wood gas1
//       //devolKinetic2     (1.1E+10 1.48E+08 ); // (A2 E2 ) wood tar
//       //devolKinetic3     (3.3E+06 1.12E+08 ); // (A3 E3 ) wood char
//
//       // Wagenaar 1994
//       devolKinetic1     (1.10E+11 1.77E+08 ); // (A1 E1 ) wood gas1
//       devolKinetic2     (9.28E+09 1.49E+08 ); // (A2 E2 ) wood tar
//       devolKinetic3     (3.05E+07 1.25E+08 ); // (A3 E3 ) wood char
//
//        // H. Strom H. Thunman 2013
// //       devolKinetic1     (1.3E+08 1.40E+08 ); // (A1 E1 ) wood gas1
// //       devolKinetic2     (2.0E+08 1.33E+08 ); // (A2 E2 ) wood tar
// //       devolKinetic3     (1.08E+07 1.21E+08 ); // (A3 E3 ) wood char
//
//
//
//
//
//       devolKinetic4	(4.28E+06 1.075E+08 ); // (A4 E4 ) tar light gas
//       devolKinetic5	(1.0E+05  1.075E+08 ); // (A5 E5 ) tar char
//
//
//
//
//       volgas1 //light gas
//       (
//         (H2     0.109    12  4  0.0)   // (name weight_fraction  C_mass_fraction H_mass_fraction O_mass_fraction)
//         (CO      0.396    12  4  0.0)   // (name weight_fraction C_mass_fraction H_mass_fraction O_mass_fraction)
//         (CO2     0.209    12  4  0.0)  // (name weight_fraction C_mass_fraction H_mass_fraction O_mass_fraction)
//         (H2O     0.249    12  4  0.0) // (name weight_fraction C_mass_fraction H_mass_fraction O_mass_fraction)
//         (tar     0.127    12  4  0.0) // (name weight_fraction C_mass_fraction H_mass_fraction O_mass_fraction)
//       );
//
//       volgas2
//       (
//         (CH4     0.25    12  4  0.0  77625    9.42E+07)   // (name weight_fraction  C_mass_fraction H_mass_fraction O_mass_fraction)
// //        (C2H4    0.25    12  4  0.0  144544   1.09E+08)   // (name weight_fraction C_mass_fraction H_mass_fraction O_mass_fraction)
// //        (C2H6    0.25    12  4  0.0  33       1.39E+08)  // (name weight_fraction C_mass_fraction H_mass_fraction O_mass_fraction)
//         (CO2     0.25    12  4  0.0  355      4.90E+07) // (name weight_fraction C_mass_fraction H_mass_fraction O_mass_fraction)
//         (CO      0.25    12  4  0.0  45709    8.79E+07) // (name weight_fraction C_mass_fraction H_mass_fraction O_mass_fraction)
//         (H2      0.25    12  4  0.0  4365158  1.29E+08) // (name weight_fraction C_mass_fraction H_mass_fraction O_mass_fraction)
//       );
//
//         residualCoeff   1E-06;
//     }
//
//
//     COxidationKineticDiffusionLimitedRateWithAshCoeffs
//     {
//         COmiga        3390.0;// activation energy in omega function
//         ep3            0.65;//porosity of ash layer
//         C1           2.03e-10;//mass diffusion constant
//         C2            1.715;//- Kinetics limited rate pre-exponential constant, C2
//         E              9000.0;//- Kinetics limited rate activation energy RR together
//       //C1              5.0E-12; //mass diffusion constant, same value for O2, CO2, and H2O
//         AO2              2.51E-03;//pre-exponential factor
//         AH2O              2.0E-03;
//         ACO2              3.0E-01;
//         EO2               7.48E+07; //activation energy
//         EH2O               1.96E+08;
//         ECO2               2.00E+08;
//     }
}


cloudFunctions
{}


// ************************************************************************* //
